; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	thermograph0 - mode
	GroundStation4 - direction
	Star5 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(have_image Planet6 thermograph0)
	(have_image Star7 thermograph1)
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 thermograph1)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 8
2. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 8
3. (turn_to satellite2 planet6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet6)
   goals met: 0 of 8
4. (take_image satellite2 planet6 instrument6 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite2 planet11 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet11)
   goals met: 1 of 8
6. (take_image satellite2 planet11 instrument6 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon9 instrument6 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 3 of 8
9. (turn_to satellite2 phenomenon13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon13)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon13 instrument6 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 4 of 8
11. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 8
12. (take_image satellite2 phenomenon10 instrument6 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 5 of 8
13. (turn_to satellite2 planet8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet8)
   goals met: 5 of 8
14. (take_image satellite2 planet8 instrument6 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 6 of 8
15. (turn_to satellite2 star12 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star12)
   goals met: 6 of 8
16. (take_image satellite2 star12 instrument6 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 7 of 8
17. (turn_to satellite2 star7 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star7)
   goals met: 7 of 8
18. (take_image satellite2 star7 instrument6 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 8 of 8
